Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: The number of strides of the pointer’s Pointee type to offset this pointer.
ja: ポインタのPointee型のストライドの数、このポインタに補われます。

source: The number of times to repeat element.
ja: elementを繰り返す回数。

source: The number of times to repeat the value passed in the repeating parameter.
ja: repeatingパラメータで渡された値を繰り返す回数。

source: The number of trailing zeros in this value’s binary representation.
ja: この値のバイナリ表現において後に続くゼロの数。

source: The number of values in the dictionary.
ja: 辞書の中の値の数。

source: The numeric value this character represents, if it is a hexadecimal digit.
ja: この文字が表す数値、もしそれが16進法桁を表すならば。

source: The numeric value this character represents, if it represents a whole number.
ja: この文字が表す数値、もしそれが整数を表すならば。

source: The only valid position in a CollectionOfOne instance is 0.
ja: CollectionOfOneインスタンスの中の唯一の有効な位置は、0です。

source: The opaque pointer to convert to a typed pointer.
ja: 型付ポインタに変換されることになる不透明ポインタ。

source: The operation doesn’t require going beyond the limiting numbers.endIndex value, so it succeeds.
ja: この操作は、限度であるnumbers.endIndex値を越えることを要求しません、それでそれは成功します。

source: The operation doesn’t require going beyond the limiting s.endIndex value, so it succeeds.
ja: 演算は、限界であるs.endIndex値を越えていく必要はありません、それでそれは成功します。

source: The order of key-value pairs in a dictionary is stable between mutations but is otherwise unpredictable.
ja: 辞書中のキー値ペアの順番は各変化間は安定しています、しかしそれ以外では予測できません。

source: The order of the remaining elements is preserved.
ja: 残っている要素の順番は保全されます。

source: The other value to multiply.
ja: 掛け合わされることになるもう一方の値。

source: The output from each call to debugPrint(_:separator:terminator:) includes a newline by default.
ja: debugPrint(_:separator:terminator:)への各呼び出しからの出力は、初期状態では改行を含みます。

source: The output from each call to debugPrint(_:separator:terminator:to:) includes a newline by default.
ja: debugPrint(_:separator:terminator:to:)への各呼び出しからの出力は、初期状態では改行を含みます。

source: The output from each call to print(_:separator:terminator:) includes a newline by default.
ja: print(_:separator:terminator:)への各呼び出しからの出力は、初期状態では改行を含みます。

source: The output from each call to print(_:separator:terminator:to:) includes a newline by default.
ja: print(_:separator:terminator:to:)への各呼び出しからの出力は、初期状態では改行を含みます。

source: The overflow addition operator (&+) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー加算演算子（&+）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The overflow multiplication operator (&*) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー乗算演算子（&*）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The overflow subtraction operator (&-) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー減算演算子（&-）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The path of coding keys taken to get to the point of the failing decode call.
ja: 失敗しているデコード呼び出しの地点に行くために取られるコーディングキーのパス。

source: The path of coding keys taken to get to the point of the failing encode call.
ja: 失敗しているエンコード呼び出しの地点に行くために取られるコーディングキーのパス。

source: The path of coding keys taken to get to this point in decoding.
ja: デコーディングのこの時点を得るために取られるコーディングキーのパス。

source: The path of coding keys taken to get to this point in encoding.
ja: エンコーディングのこの時点を得るために取られるコーディングキーのパス。

source: The path should be relative to your project, similar to the way your Info.plist path is specified in Build Settings.
ja: パスは、あなたのInfo.plistパスがBuild Settingsにおいて指定される方法と同様に、あなたのプロジェクトに対して相対的であるべきです。

source: The pattern-matching operator (~=) is used internally in case statements for pattern matching.
ja: パターンマッチング演算子（~=）は、内部的にcase文の中でパターンマッチングのために使われます。

source: The pattern-matching operator is primarily intended to enable case statement pattern matching.
ja: パターンマッチング演算子は、元来case文パターンマッチングをできるようにすることを意図されます。

source: The pattern-matching operator is used internally in case statements for pattern matching.
ja: パターンマッチング演算子は、内部的にcase文の中でパターンマッチングのために使われます。

source: The payload consists of a sequence of decimal digits, or the characters 0X or 0x followed by a sequence of hexadecimal digits.
ja: ペイロードは、一連の10進の桁、または文字0Xか0xに続く一連の16進の桁から成ります。

source: The payload to use for the new NaN value.
ja: 新しいNaN値のために使うためのペイロード。

source: The performance of some collection operations depends on the type of index that the collection provides.
ja: いくつかのコレクション演算の性能は、コレクションの提供するインデックスの型に依存します。

source: The pointer argument is valid only for the duration of the function’s execution.
ja: ポインタ引数は、関数の実行の継続期間に対してだけ有効です。

source: The pointer argument is valid only for the duration of the method’s execution.
ja: ポインタ引数は、ただメソッドの実行の間に対してのみ有効です。

source: The pointer argument to body is valid only during the execution of withUnsafeMutablePointer(to:_:).
ja: bodyへのポインタ引数は、withUnsafeMutablePointer(to:_:)の実行の間のみ有効です。

source: The pointer argument to body is valid only during the execution of withUnsafePointer(to:_:).
ja: bodyへのポインタ引数は、withUnsafePointer(to:_:)の実行の間のみ有効です。

source: The pointer passed as an argument to body is valid only during the execution of withUnsafeBufferPointer(_:).
ja: 引数としてbodyに渡されるポインタは、withUnsafeBufferPointer(_:)の実行の間のみ有効です。

source: The pointer passed as an argument to body is valid only during the execution of withUnsafeMutableBufferPointer(_:).
ja: 引数としてbodyに渡されるポインタは、withUnsafeMutableBufferPointer(_:)の実行の間のみ有効です。

source: The pointer passed as an argument to body is valid only during the execution of withVaList(_:_:).
ja: 引数としてbodyに渡されるポインタは、withVaList(_:_:)の実行の間のみ有効です。

source: The pointer passed as an argument to body is valid only for the lifetime of the closure.
ja: 引数としてbodyに渡されるポインタは、このクロージャの生涯に対してのみ有効です。

source: The pointer to calculate the distance to.
ja: それへの隔たりを計算されるポインタ。

source: The pointer to use as the source for the new integer.
ja: 新しい整数のためのソースとして使う値。

source: The position at which to insert the new element.
ja: そこで新しい要素が挿入されることになる位置。

source: The position at which to insert the new elements.
ja: そこで新しいいくらかの要素が挿入されるところの位置。

source: The position of a collection difference.
ja: あるコレクション差異の位置。

source: The position of a key-value pair in a dictionary.
ja: 辞書の中でのあるキー値ペアの位置。

source: The position of the element to access.
ja: アクセスする要素の位置。

source: The position of the element to remove.
ja: 削除する要素の位置。

source: The position of the first element in a non-empty collection.
ja: 空でないコレクションにおける最初の要素の位置。

source: The position of the first element in a nonempty array.
ja: 空でない集合の中の最初の要素の位置。

source: The position of the first element in a nonempty collection.
ja: 空でないコレクションの中の最初の要素の位置。

source: The position of the first element in a nonempty dictionary.
ja: 空でない辞書の中の最初の要素の位置。

source: The position of the first element in the range.
ja: 範囲の中の最初の要素の位置。

source: The position of the first element.
ja: 最初の要素の位置。

source: The position of the key-value pair to access.
ja: この位置のキー値ペアにアクセスします。

source: The position of the key-value pair to remove.
ja: 削除されるキー値ペアの位置。

source: The positive difference between 1.0 and the next greater representable number.
ja: 1.0と次により大きい表現可能な数との間の正の差異。

source: The predicate executes each time the asynchronous sequence produces an element, until either the predicate finds a match or the sequence ends.
ja: 述部は、非同期シーケンスがある要素を生み出すたびごとに遂行されます、述部がある合致を見つけるかシーケンスが終わるかどちらかまで。

source: The predicate executes each time the asynchronous sequence produces an element, until either the predicate returns false or the sequence ends.
ja: 述部は、非同期シーケンスがある要素を生み出すたびごとに遂行されます、述部がfalseを返すかシーケンスが終わるかどちらかまで。

source: The predicate must be a equivalence relation over the elements.
ja: 述部は要素に対して同値関係でなければなりません。

source: The predicate must be a strict weak ordering over the elements.
ja: 述部は、それら要素に対して厳密弱順序でなければなりません。

source: The predicate orders errors before successes and sorts the error responses by their error code.
ja: この述部はエラーを成功の前に並べて、そしてそれらエラー応答をそのエラーコードによってソートします。

source: The predicate passed to the drop(while:) method throws an error if it encounters an even number, and otherwise returns true while it receives elements less than 5.
ja: drop(while:)メソッドに渡される述部は、それが偶数に出会うならばエラーをスローします、そしてそうでなければtrueを、それが5より少ない要素を受けとる間ずっと返します。

source: The predicate provided to the max(by:) method sorts ranks based on their rawValue:
ja: max(by:)メソッドに提供された述部は、ランクそれらをそれらのrawValueに基づいて並べ換えます：

source: The predicate provided to the min(by:) method sorts ranks based on their rawValue:
ja: min(by:)メソッドに提供された述部は、ランクそれらをそれらのrawValueに基づいて並べ換えます：

source: The prefix sequence produces whatever type of element its base iterator produces.
ja: prefixシーケンスは、それの基底イテレータが生み出す要素の型が何であろうとも生み出します。

source: The prefix-while sequence produces whatever type of element its base iterator produces.
ja: prefix-whileシーケンスは、それの基底イテレータが生み出す要素の型が何であろうとも生み出します。

source: The process for importing Swift declarations into Objective-C code differs slightly depending on whether you’re writing an app or a framework.
ja: Swift宣言をObjective-Cコードにインポートする行程は、あなたがアプリを書いているかフレームワークを書いているかに従い、わずかに異なります。

source: The process for using your Objective-C declarations from your Swift code within mixed-language targets differs slightly depending on whether you’re writing an app or a framework.
ja: あなたのObjective-C宣言をあなたのSwiftコードから混合言語ターゲット内部において使うことに対する行程は、あなたがアプリをまたはフレームワークを書くかによって少しばかり異なります。

source: The product of lhs and rhs, added to this value.
ja: この値に加えられることになる、lhsとrhsの積。

source: The product of x and y is 2000, which is too large to represent in a UInt8 instance.
ja: xとyの積は2000です、それはUInt8インスタンスにおいて表すには大きすぎます。

source: The product of x and y is -1920, which is too large to represent in an Int8 instance.
ja: xとyの積は-1920です、それはInt8インスタンスにおいて表すには大きすぎます。

source: The product of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の積は、引数の持つ型において表現可能でなければなりません。

source: The protocol defines a single asynchronous method, next(), which either produces the next element of the sequence, or returns nil to signal the end of the sequence.
ja: プロトコルは、ただ１つの非同期メソッドnext()を定義します、それはシーケンスの次の要素を取り出すか、またはnilを返してシーケンスの終わりを合図するかのどちらかです。

source: The protocol to which all class types implicitly conform.
ja: このプロトコルに対して、全てのクラス型は暗黙的に準拠します。

source: The protocol to which all classes implicitly conform.
ja: このプロトコルに対して、全てのクラスは暗黙的に準拠します。

source: The radix, or base of exponentiation, for a floating-point type.
ja: ある浮動小数点型の基数、または冪演算の底。

source: The radix, or base, to use for converting text to an integer value.
ja: textを整数値に変換するのに使うための基数、または底。

source: The random number generator to use when choosing a random element.
ja: ある無作為な要素を選ぶときに使う無作為数生成子。

source: The random number generator to use when creating the new random value.
ja: 新しい無作為値を作成するときに使う無作為数生成子。

source: The random number generator to use when shuffling the collection.
ja: コレクションをシャッフルするときに使う無作為数生成子。

source: The random number generator to use when shuffling the sequence.
ja: シーケンスをシャッフルするときに使う無作為数生成子。

source: The range expression is converted to a concrete subrange relative to this collection.
ja: 範囲式は、このコレクションに関連するある具体的な下位範囲へ変換されます。

source: The range in which to create a random value.
ja: その中においてある無作為な値が作成される範囲。

source: The range of the collection to be removed.
ja: 削除されることになるコレクションの範囲。

source: The range to clamp the bounds of this range.
ja: この範囲に制限を課すための範囲。

source: The range’s lower bound.
ja: その範囲の下方の境界。

source: The range’s upper bound.
ja: その範囲の上方の境界。

source: The range’s “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: 範囲の「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: The raw encoding of the value’s exponent field.
ja: 値のもつ指数部の生のエンコーディング。

source: The raw encoding of the value’s significand field.
ja: 値の仮数フィールドの生のエンコーディング。

source: The raw type that can be used to represent all values of the conforming type.
ja: 準拠している型のすべての値を表すために使われる生の型。

source: The raw value to use for the new instance.
ja: 新しいインスタンスのために使う生の値。

source: The reference writeable key path to append.
ja: 書き込み可能なキーパスの参照、これに対して追加します。

source: The remainder has the same sign as lhs.
ja: 余りは、lhsと同じ符号を持ちます。

source: The remainder of the relational operator functions are implemented by the standard library for any type that conforms to Comparable.
ja: 残りの関係演算子関数は、Comparableに準拠するあらゆる型に対して標準ライブラリによって実装されます。

source: The remainder of this value divided by other using truncating division.
ja: 切り捨て除算を使ってotherで除算されたこの値の余りを返します。

source: The remainder of this value divided by other.
ja: otherで除算されたこの値の余りを返します。

source: The removals contained by this difference, from lowest offset to highest.
ja: この差異によって含まれる除去、最も低いオフセットから最も高い方へと。

source: The removed element.
ja: 削除された要素。

source: The requested number of elements to store.
ja: 依頼された格納される要素数。

source: The requested number of key-value pairs to store.
ja: 要請された数のキー値ペアを格納します。

source: The required methods that are suffixed with ReportingOverflow serve as the customization points for arithmetic operations.
ja: 必須メソッドでReportingOverflowを末尾に付けられるものは、算術演算に対するカスタマイズポイントとして供されます。

source: The result begins with the first element of numbers that does not satisfy predicate.
ja: 結果は、predicateを満たさない、numbersの最初の要素で始まります。

source: The result can be negative only if the collection conforms to the BidirectionalCollection protocol.
ja: 結果は、そのコレクションがBidirectionalCollectionプロトコルに準拠する場合に限り、負であることができます。

source: The result has the same sign as lhs and has a magnitude less than rhs.magnitude.
ja: 結果は、lhsと同じ符号を持ち、rhs.magnitudeより小さい規模を持ちます。

source: The result is always exact.
ja: 結果は常に厳密に正確です。

source: The result of evaluating rhs is the result of the || operation.
ja: rhsを評価することの結果は、||演算の結果です。

source: The result of evaluating rhs is the result of the && operation.
ja: rhsを評価することの結果は、&&演算の結果です。

source: The result of the initializer has the same magnitude as magnitudeOf.
ja: イニシャライザの結果は、magnitudeOfと同じ規模を持ちます。

source: The result of the initializer has the same sign as signOf.
ja: イニシャライザの結果は、signOfと同じ符号を持ちます。

source: The result of the operation is false.
ja: この演算の結果は、falseです。

source: The result of the operation is true.
ja: この演算の結果は、trueです。

source: The result of the remainder operator (%) has the same sign as lhs and has a magnitude less than rhs.magnitude.
ja: 剰余演算子（%）の結果は、lhsと同じ符号を持ち、rhs.magnitudeより小さい規模を持ちます。

source: The result of this operation will be the same type as its arguments.
ja: この演算の結果は、それの引数と同じ型になります。

source: The result of this operation will have the non-optional type of the left-hand side’s Wrapped type.
ja: この演算の結果は、左手側のもつWrapped型の非オプショナル型を持つことになります。

source: The resulting array consists of at most maxSplits + 1 subsequences.
ja: 結果の配列は、多くともmaxSplits + 1の下位シーケンスから成ります。

source: The resulting collection has the type of argument on the right-hand side.
ja: 結果となるコレクションは、右手側の引数の型を持ちます。

source: The resulting collection has the type of the argument on the left-hand side.
ja: 結果となるコレクションは、左手側の引数の型を持ちます。

source: The resulting flattened array.
ja: 結果として生じる平たくされた配列。

source: The resulting instance may not have the same numeric value as bitPattern—it is only guaranteed to use the same pattern of bits in its binary representation.
ja: 結果のインスタンスは、bitPatternと同じ数値を持たないかもしれません — それは、同じパターンのビットをそれのバイナリ表現において使うことを保証されるだけです。

source: The resulting pointer must be within the bounds of the same allocation as this pointer.
ja: 結果のポインタは、このポインタと同じアロケーションの範囲内でなければなりません。

source: The resulting quotient must be representable within the bounds of the type.
ja: 結果の商は、この型の境界の内に表現可能でなければなりません。

source: The resulting subsequence does not include the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みません。

source: The resulting subsequence includes the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みます。

source: The resulting value must be representable in the same type as the argument.
ja: 結果の値は、引数と同じ型で表現可能でなければなりません。

source: The resulting value must be representable within the value’s type.
ja: 結果の値は、その値の持つ型の内部に表現可能でなければなりません。

source: The retrieved slice of text is equivalent in each of these cases.
ja: 取って来たtextのスライスは、それらの場合それぞれにで同等です。

source: The return type of functions that do not return normally, that is, a type with no values.
ja: 普通に戻らない関数の戻り型、すなわち、値なしでの型。

source: The return value, if any, of the body closure parameter.
ja: bodyクロージャパラメータの戻り値、もしあれば。

source: The return value, if any, of the body closure.
ja: bodyクロージャの、もしあれば、戻り値。

source: The returned ArraySlice instance uses the same indices for the same elements as the original array.
ja: 返されたArraySliceインスタンスは、同じ要素に対して元のコレクションと同じインデックスを使います。

source: The returned range is not guaranteed to be inside the bounds of collection.
ja: 返される範囲は、collectionの境界内であると保証されません。

source: The right-hand side of the operation.
ja: 演算子の右手側。

source: The root type for this key path.
ja: このキーパスのためのルート型。

source: The rounding rule to use.
ja: この丸め規則を使います。

source: The same state is passed to all invocations of next, so subsequent calls will see any mutations made by previous calls.
ja: その同じ状態は、nextのすべてに呼び出しに対して渡されます、なので続いて起こる呼び出しは前の呼び出しによって為される何らかの変化を見ることになるでしょう。

source: The second call to appending(path:) returns nil because the root type of arrayDescription, Array<Int>, does not match the value type of stringLength, Int.
ja: ２番目のappending(path:)への呼び出しはnilを返します、なぜならarrayDescriptionのルート型、Array<Int>は、stringLengthの値型、Intと合致しないからです。

source: The second call to appending(path:) returns nil because the root type of the path parameter, Double, does not match the value type of arrayDescription, String.
ja: ２番目のappending(path:)への呼び出しはnilを返します、なぜならpathパラメータのルート型、Doubleは、arrayDescriptionの値型、Stringと合致しないからです。

source: The second example passes 1 for the maxSplits parameter, so the original string is split just once, into two new strings.
ja: ２番目の例は1をmaxSplitsパラメータに渡します、それで元の文字列は一度だけ分割されて、２つの新しい文字列になります。

source: The second partition, numbers[p...], is made up of the elements that are greater than 30.
ja: ２番目の区画、numbers[p...]は、30より大きなものである要素から構成されます。

source: The second sequence or collection to zip.
ja: 組み合わされる第２のシーケンスまたはコレクション。

source: The second value to add.
ja: 加算する第２の値。

source: The second value to multiply.
ja: 掛け合わされる第２の値。

source: The second value to swap.
ja: 交換する２つ目の値。

source: The second version of allValues(in:match:) compiles without error, with the compiler guaranteeing that the escapablePredicate closure doesn’t last beyond the call to withoutActuallyEscaping(_:do:).
ja: ２番目のバージョンのallValues(in:match:)は、escapablePredicateクロージャがwithoutActuallyEscaping(_:do:)の呼び出しを越えて持ちこたえないことをコンパイラが保証して、エラーなしでコンパイルします。

source: The second version, present(), returns a Boolean value and is an asynchronous method.
ja: ２番目のバージョン、present()は、ブール値を返します、そして非同期メソッドです。

source: The selector piece for the completion handler is removed.
ja: 完了ハンドラのセレクタ部分は、取り除かれます。

source: The sequence ends either when the base sequence ends or when transform throws an error.
ja: シーケンスは、基底シーケンスが終わる時かまたはtransformがエラーをスローする時に終わります。

source: The sequence ends either when the the last sequence created from the last element from base sequence ends, or when transform throws an error.
ja: シーケンスは、基底シーケンスからの最後の要素から作成された最後のシーケンスが終わる時、またはtransformがエラーをスローする時のどちらかに終わります。

source: The sequence ends when next returns nil.
ja: このシーケンスは、nextがnilを返す時に終わります。

source: The sequence must be finite.
ja: シーケンスは有限でなければなりません。

source: The sequence of elements for the new collection.
ja: 新しいコレクションのための要素からなるシーケンス。

source: The sequence of elements to turn into an array.
ja: 配列になることになる、いくらかの要素からなるシーケンス。

source: The sequence’s maximum element if the sequence is not empty; otherwise, nil.
ja: シーケンスが空でないならばシーケンスの最大の要素；そうでなければnil。

source: The sequence’s maximum element.
ja: シーケンスの最大の要素。

source: The sequence’s minimum element, according to areInIncreasingOrder.
ja: シーケンスの最小の要素、areInIncreasingOrderによる。

source: The sequence’s minimum element.
ja: シーケンスの最小の要素。

source: The set of characters that have an isMathSymbol value of true is not a strict subset of those for which isSymbol is true.
ja: isMathSymbolの値にtrueを持つ文字の集合は、それらに対してisSymbolがtrueであるものの狭義の部分集合ではありません。

source: The shared actor instance that will be used to provide mutually-exclusive access to declarations annotated with the given global actor type.
ja: 共有アクターインスタンス、それは与えられたグローバルアクター型で注釈を付けられた宣言への相互排他アクセスを提供するために使われます。

source: The shared executor instance that will be used to provide mutually-exclusive access for the global actor.
ja: 共有エグゼキュータ（遂行者）インスタンス、それはグローバルアクターに対する相互排他アクセスを提供するために使われます。

source: The shift is performed using this masked value.
ja: シフトは、このマスクされた値を使って実行されます。

source: The sign for a negative value.
ja: 負の値に対する符号。

source: The sign for a positive value.
ja: 正の値に対する符号。

source: The sign of a floating-point value.
ja: ある浮動小数点値の符号。

source: The sign of the floating-point value.
ja: 浮動小数点値の符号。

source: The sign of the new value.
ja: 新しい値の符号。

source: The sign of this number, expressed as an integer of the same type.
ja: この数の符号、同じ型の整数として表されます。

source: The sign to use for the new value.
ja: 新しい値に対して使うための符号。

source: The significand is frequently also called the mantissa, but significand is the preferred terminology in the IEEE 754 specification, to allay confusion with the use of mantissa for the fractional part of a logarithm.
ja: 仮数（significand）はしばしばmantissaとも呼ばれます、しかし仮数がIEEE 754仕様において推奨される用語です、対数の小数部分に対する仮数（mantissa）の使用との混同を静めるためです。

source: The significand may include a decimal point.
ja: 仮数は、小数点を含んでも構いません。

source: The significand of y is therefore 1.34375.
ja: yの仮数はしたがって1.34375です。

source: The significand of the floating-point value.
ja: 浮動小数点値の仮数。

source: The single Bool type in Swift guarantees that functions, methods, and properties imported from C and Objective-C have a consistent type interface.
ja: Swift保証の単一Bool型で、関数、メソッド、そしてプロパティがCおよびObjective-Cからインポートしたものは、首尾一貫した型インターフェイスを持ちます。

source: The single-character string to convert to a Character instance.
ja: Characterインスタンスへと変換される単一文字文字列。

source: The sorting algorithm is not guaranteed to be stable.
ja: このソートアルゴリズムは、安定であることを保証されません。

source: The square root of the value.
ja: この値の平方根。

source: The stable identity of the entity associated with this instance.
ja: このインスタンスと結び付けられた登録項目の安定した同一性。

source: The standard library floating-point types—Float, Double, and Float80 where available—all conform to the ExpressibleByFloatLiteral protocol.
ja: 標準ライブラリ浮動小数点型—Float、Double、そして利用可能なところではFloat80—は、すべてExpressibleByFloatLiteralプロトコルに準拠します。

source: The standard library integer and floating-point types are all valid types for IntegerLiteralType.
ja: 標準ライブラリの整数および浮動小数点型は、IntegerLiteralTypeに対する有効な型のすべてです。

source: The standard library integer and floating-point types, such as Int and Double, conform to the ExpressibleByIntegerLiteral protocol.
ja: 標準ライブラリの整数および浮動小数点型、例えばIntおよびDoubleは、ExpressibleByIntegerLiteralプロトコルに準拠します。

source: The standard library provides an implementation for the not-equal-to operator (!=) for any Equatable type, which calls the custom == function and negates its result.
ja: 標準ライブラリは、不等演算子（!=）のある実装をあらゆるEquatable型に対して実装します、それはあつらえの==関数を呼び出してそれの結果を逆にします。

source: The start and end of a subrange must be valid indices of the array.
ja: 下位範囲の始まりと終わりは、配列の有効なインデックスでなければなりません。

source: The starting value to use for the sequence.
ja: シーケンスに使うための開始値。

source: The stream to use for writing the contents of value.
ja: valueの内容を書き出すために使うことになるストリーム。

source: The stream was cancelled
ja: ストリームは取り消されました

source: The stream was finished via the finish method
ja: ストリームはfinishメソッド経由で終了されました

source: The string of characters read from standard input.
ja: 標準入力から読み込まれた一続きの文字。

source: The string passed as description may begin with a plus or minus sign character (+ or -), followed by one or more numeric digits (0-9).
ja: descriptionとして渡される文字列は、プラスまたはマイナス符号文字（+または-）で始まり、１つ以上の数値のアラビア数字（0-9）が続くことがあります。

source: The string passed as text can represent a real number in decimal or hexadecimal format or special floating-point values for infinity and NaN (“not a number”).
ja: textとして渡される文字列は、10進または16進数形式における実数、または無限大とNaN（「非数」）に対する特別な浮動小数点値を表せます。
